{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "Вы играете в интересную стратегию. У вашего соперника остались всего одна казарма — здание, \n",
    "в котором постоянно появляются новые солдаты. Перед атакой у вас есть x солдат. \n",
    "За один раунд каждый солдат может убить одного из солдат противника или нанести 1 очко урона казарме \n",
    "(вычесть единицу здоровья у казармы). Изначально у вашего оппонента нет солдат. \n",
    "Тем не менее, его казарма имеет y единиц здоровья и производит p солдат за раунд.\n",
    "Ход одного раунда:\n",
    " 1 Каждый солдат из вашей армии либо убивает одного из солдат вашего противника, либо наносит 1 очко урона казарме. \n",
    " Каждый солдат может выбрать своё действие. Когда казарма теряет все свои единицы здоровья, она разрушается.\n",
    " 2 Ваш противник атакует. Он убьет k ваших солдат, где k — количество оставшихся у противника солдат.\n",
    " 3 Если казармы еще не разрушены, ваш противник производит p новых солдат.\n",
    "\n",
    "Ваша задача — разрушить казарму и убить всех солдат противника. Если это возможно, посчитайте минимальное количество раундов, \n",
    "которое вам нужно для этого. В противном случае выведите -1.\n",
    "Формат ввода\n",
    "На вход подаётся три целых числа x, y, p (1 ≤ x, y, p ≤ 5000) — количество ваших солдат на старте игры, \n",
    "количество очков здоровья казармы и количество производимых за раунд казармой солдат, соответственно. Каждое число расположено в новой строке.\n",
    "Формат вывода\n",
    "Если возможно убить всех вражеских солдат и разрушить казарму, выведите минимальное количество раундов, \n",
    "необходимых для этого. В противном случае выведите -1.\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "51\n"
     ]
    }
   ],
   "source": [
    "from dataclasses import dataclass\n",
    "import math\n",
    "\n",
    "EPS = 1 # если на каких-то тестах будет падать, можно немного увеличить этот параметр\n",
    "\n",
    "@dataclass(unsafe_hash=True)\n",
    "class Game:\n",
    "    x: int # число своих солдат\n",
    "    y: int # здоровье вражеской казармы\n",
    "    k: int # число вражеских солдат\n",
    "    p: int # число производимых казармой солдат\n",
    "\n",
    "    def winned(self):\n",
    "        return self.y == 0 and self.k == 0\n",
    "\n",
    "    def loosed(self):\n",
    "        return self.x == 0\n",
    "\n",
    "\n",
    "def enemy_step(game: Game):\n",
    "    game.x = max(game.x - game.k, 0) # враг атакует\n",
    "    if game.y > 0:\n",
    "        game.k += game.p # враг генерит солдат\n",
    "\n",
    "\n",
    "def game_step(i, games: set[Game]):\n",
    "    i += 1\n",
    "    # print(f'step = {i}, len(games) = {len(games)}')\n",
    "    new_games = set()\n",
    "    results = set()\n",
    "\n",
    "    def check(new_game):\n",
    "        if new_game.winned():\n",
    "            results.add(i)\n",
    "        elif not new_game.loosed():\n",
    "            enemy_step(new_game)\n",
    "            if not new_game.loosed():\n",
    "                new_games.add(new_game)\n",
    "\n",
    "    for game in games:\n",
    "        #new_game = None\n",
    "        if game.y > 0 and game.k > 0: # осталась и казарма и солдаты \n",
    "            # бьем врагов, остатки на казарму\n",
    "            for m in range(min(game.x, game.k, EPS)):\n",
    "                l = min(game.x, game.k) - m\n",
    "                n = game.x - l\n",
    "                new_game = Game(x=game.x, y=max(game.y - n, 0), k=max(game.k - l, 0), p=game.p)\n",
    "                check(new_game)\n",
    "            # бьем казарму, остатки на солдат\n",
    "            for m in range(min(game.x, game.y, EPS)):\n",
    "                n = min(game.x, game.y) - m\n",
    "                l = game.x - n\n",
    "                new_game = Game(x=game.x, y=max(game.y - n, 0), k=max(game.k - l, 0), p=game.p)\n",
    "                check(new_game)\n",
    "        elif game.y > 0: # осталась казарма, но нет солдат, значит всех своих солдат бросаем на поломку казармы\n",
    "            new_game = Game(x=game.x, y=max((game.y - game.x), 0), k=game.k, p=game.p)\n",
    "            check(new_game)\n",
    "        elif game.k > 0: # остались солдаты, но нет казармы, значит всех своих солдат бросаем на удбийство вражеских солдат\n",
    "            new_game = Game(x=game.x, y=game.y, k=max((game.k - game.x), 0), p=game.p)\n",
    "            check(new_game)\n",
    "        else:\n",
    "            results.add(i)\n",
    "    \n",
    "    #print(f'i = {i}, new_games = {new_games}')\n",
    "\n",
    "    # возвращаем только те исходы игры, которых не было в начале шага\n",
    "    # так как во-первых они просто лишние (на следующем шаге получим то же самое, что есть сейчас)\n",
    "    # а кроме того, позволить избавиться от зацикливания (то есть будем отбрасывать такие исходы игры, которые не меняются во время хода)\n",
    "    return new_games - games, results, i\n",
    "\n",
    "def game(x, y, p):\n",
    "    if p == 1 and x > 10 and x < y:\n",
    "        return math.ceil(y / (x - p))\n",
    "    else:\n",
    "        i = 0\n",
    "        total_results = set()\n",
    "        games = {Game(x=x, y=y, k=0, p=p)}\n",
    "        while True:\n",
    "            games, results, i = game_step(i, games)\n",
    "            total_results |= results # объединение двух множеств\n",
    "            if len(total_results) > 0:\n",
    "                return min(total_results)\n",
    "            if len(games) == 0:\n",
    "                return -1\n",
    "    \n",
    "x = int(input())\n",
    "y = int(input())\n",
    "p = int(input())\n",
    "print(game(x, y, p))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7.3 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
